--liquibase formatted sql
--changeset gbroccol:2024-11-17--0004-fill-table-dictionary-tag

INSERT INTO dictionary.tag(tag_id, name)
VALUES (1, 'завтрак'),
       (2, 'обед'),
       (3, 'ужин'),
       (4, 'перекус'),
       (5, 'первое'),
       (6, 'второе'),
       (7, 'десерт'),
       (8, 'салат'),
       (9, 'паста'),
       (10, 'смузи'),
       (11, 'суп'),
       (12, 'выпечка'),
       (13, 'запеканка'),
       (14, 'новый год'),
       (15, 'рождество'),
       (16, 'пасха'),
       (17, 'пицца');