--liquibase formatted sql
--changeset gbroccol:2024-11-17--0008-fill-table-food-ingredient

INSERT INTO food.ingredient (ingredient_id, name)
VALUES ('fcb04c28-0b2c-4787-bde8-8f477ead9ccd', 'Шампиньоны'),
        ('763f9262-1124-44e2-b45d-4cfbbf9b8362', 'Куриное филе (грудка'),
        ('f1236e60-df0f-4b9e-9c35-c63136840846', 'Лук красный'),
        ('5154352f-c73a-4504-a5b3-53c6bbd10f3f', 'Сметана 10%'),
        ('4203f901-dd29-4576-a019-7dd3382e37b6', 'Сыр лёгкий 15%'),
        ('570f8b41-a06b-49ec-ad14-3b48f4cfd3d3', 'Оливковое масло'),
        ('5fb66e23-6721-4823-a102-832dc316d95d', 'Петрушка'),
        ('5d9843c4-5fda-41a0-868b-481c899dff3c', 'Паста (макароны из твердых сортов пшеницы)');

INSERT INTO food.recipe_ingredient (recipe_id, ingredient_id, unit_id, amount)
VALUES ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', 'fcb04c28-0b2c-4787-bde8-8f477ead9ccd', 7, 250),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', '763f9262-1124-44e2-b45d-4cfbbf9b8362', 7, 400),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', 'f1236e60-df0f-4b9e-9c35-c63136840846', 7, 100),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', '5154352f-c73a-4504-a5b3-53c6bbd10f3f', 7, 250),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', '4203f901-dd29-4576-a019-7dd3382e37b6', 7, 140),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', '570f8b41-a06b-49ec-ad14-3b48f4cfd3d3', 7, 20),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', '5fb66e23-6721-4823-a102-832dc316d95d', 11, null),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', '5d9843c4-5fda-41a0-868b-481c899dff3c', 7, 320);

INSERT INTO food.step (recipe_id, step_id, step_number, description)
VALUES ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', '0663c6e3-36f1-4b04-a411-a7af89c87045', 1, 'Лук нарезать полукольцами, шампиньоны пластинками, филе курицы - кубиком.'),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', '568b187a-4837-4ceb-ba24-880d13236204', 2, 'В разогретую сковороду добавить масла и выложить грибы. Тушить на среднем огне, помешивая, 5-7 минут.'),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', '8c4948cd-9808-4f83-ae87-62139aca7c4d', 3, 'Добавить лук и тушить все вместе 2-3 минуты'),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', '6e3a3399-983c-479f-85f9-5388bb1d074d', 4, 'Затем добавить курицу и тушить 7-10 минут под крышкой, периодически помешивая.'),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', '0c83a676-5e05-4963-9b86-650d58618bad', 5, 'Добавить в сковороду сметану, немного воды, специи и соль по вкусу, накрыть крышкой и тушить около 10-15 минут.'),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', '97606352-042b-4d61-b630-ebe758e27243', 6, 'В кипящую подсоленную воду опустить пасту и варить до готовности 5-8 минут. При варке добавить в воду оливковое масло.'),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', '1cd07aef-3325-49f6-b622-c194573c4da1', 7, 'Пасту откинуть на сито, чтобы стекла лишняя вода, затем добавить в сковороду к грибам и курице, перемешать и прогреть 2-3 минуты.'),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', 'c139d18f-3873-4619-9585-a767155685f6', 8, 'При подаче посыпать сыром и рубленной петрушкой. Готово!');

INSERT INTO food.recipe_tag (recipe_id, tag_id)
VALUES ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', 3),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', 6),
        ('6428a40b-ffb6-4218-b21f-acbb6a0a4f75', 9);
